In [1]:
# import dependencies
import pandas as pd

# Database
from sqlalchemy import create_engine
from config import username, db_password

In [2]:
#  create the database engine
db_string = f"postgresql://{username}:{db_password}@127.0.0.1:5432/FinalProject"
engine = create_engine(db_string)

In [3]:
# read in data
population2019_df = pd.read_csv("resources/2019_Census_US_Population_Data_By_State_Lat_Long.csv")
population2020_df = pd.read_csv("resources/us_pop_by_state.csv")
population2021_df = pd.read_csv("resources/2021 population USDA.gov.csv")
zillow_df = pd.read_csv("resources/ZHVI.csv")
housing_df = pd.read_csv("resources/realtor-data.csv")

In [4]:
# preview data frames
population2019_df.head()

   state_name  popestimate       lat     long
0     alabama      4903185  32.37772  -86.301
1      alaska       731545  58.30160 -134.420
2     arizona      7278717  33.44814 -112.097
3    arkansas      3017804  34.74661  -92.289
4  california     39512223  38.57667 -121.494

In [5]:
population2020_df.head()

   rank         state state_code  2020_census  percent_of_total
0   1.0    California         CA     39538223            0.1191
1   2.0         Texas         TX     29145505            0.0874
2   3.0       Florida         FL     21538187            0.0647
3   4.0      New York         NY     20201249            0.0586
4   5.0  Pennsylvania         PA     13002700            0.0386

In [6]:
population2021_df.head()

,state_name,pop_1990,pop_2000,pop_2010,pop_2020,pop_2021,change2020_21
0,united states,248790925.0,281424600.0,308745538.0,331449281.0,331893745.0,0.10%
1,alabama,4040389.0,4447207.0,4779736.0,5024279.0,5039877.0,0.30%
2,alaska,550043.0,626933.0,710231.0,733391.0,732673.0,-0.10%
3,arizona,3665339.0,5130247.0,6392017.0,7151502.0,7276316.0,1.70%
4,arkansas,2350624.0,2673293.0,2915918.0,3011524.0,3025891.0,0.50%

In [7]:
zillow_df.head()

,Unnamed: 0,Virginia,California,Florida,Texas,New York,Arizona,New Jersey,West Virginia,Nevada,...,Ohio,New Hampshire,Alaska,Oklahoma,Arkansas,Alabama,Louisiana,South Dakota,Wyoming,Mississippi
0,2000-01-01,137233.0,199238.0,115665.0,114445.0,150761.0,135257.0,185076.0,71413.0,162642.0,...,112006.0,139728.0,132292.0,80820.0,81668.0,103937.0,106413.0,119069.0,NaN,85835.0
1,2000-02-01,137726.0,200084.0,116007.0,114569.0,151532.0,135585.0,185840.0,71473.0,162689.0,...,112171.0,140419.0,132480.0,80886.0,81842.0,104218.0,106762.0,118802.0,NaN,85847.0
2,2000-03-01,138185.0,201150.0,116368.0,114609.0,152176.0,135970.0,186480.0,71547.0,163004.0,...,112347.0,141141.0,132632.0,81104.0,81995.0,104372.0,106969.0,118429.0,NaN,85893.0
3,2000-04-01,139012.0,203391.0,117069.0,114816.0,153537.0,136721.0,187858.0,71680.0,163673.0,...,112803.0,142118.0,132759.0,81443.0,82306.0,104722.0,107434.0,118016.0,NaN,86054.0
4,2000-05-01,139735.0,205795.0,117736.0,114866.0,154766.0,137503.0,189055.0,71811.0,164384.0,...,113355.0,143135.0,133007.0,81847.0,82533.0,105052.0,107821.0,117942.0,NaN,86481.0

In [8]:
housing_df

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,for_sale,67000.0,2.0,1.0,0.15,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,for_sale,145000.0,4.0,2.0,0.10,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731.0,1800.0,NaN
4,for_sale,65000.0,6.0,2.0,0.05,"14 Navarro, Mayaguez, PR, 00680",14 Navarro,Mayaguez,Puerto Rico,680.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
923154,for_sale,445000.0,1.0,2.0,0.99,"1008 King St, Chappaqua, NY, 10514",1008 King St,Chappaqua,New York,10514.0,1052.0,2011-05-09
923155,for_sale,418000.0,4.0,2.0,0.40,"3 Elmwood Dr, Monroe, NY, 10950",3 Elmwood Dr,Monroe,New York,10950.0,1650.0,2015-07-21
923156,for_sale,469000.0,4.0,2.0,0.18,"13 N Conger Ave, Congers, NY, 10920",13 N Conger Ave,Congers,New York,10920.0,2123.0,NaN
923157,for_sale,825000.0,5.0,5.0,0.79,"7 Miller Rd, Valley Cottage, NY, 10989",7 Miller Rd,Valley Cottage,New York,10989.0,3775.0,2010-06-02
923158,for_sale,88000.0,NaN,NaN,35.00,"D18 Half Moon Bay Dr, Croton On Hudson, NY, 10520",D18 Half Moon Bay Dr,Croton On Hudson,New York,10520.0,780.0,NaN

## Data Preprocessing

#### 2019 Population Data

In [9]:
# rename state column to match other datasets
population2019_df = population2019_df.rename(columns={
                                        'state_name': 'state',
                                        'popestimate': 'population_2019'})

In [10]:
# drop excess columns
population2019_df = population2019_df.drop(population2019_df.columns[[2,3]], axis=1)

In [11]:
# keep only states: ca, fl, ny, tx, tn
population2019_df = population2019_df.loc[
                                (population2019_df["state"] == "california") |
                                (population2019_df["state"] == "florida") |
                                (population2019_df["state"] == "new york") |
                                (population2019_df["state"] == "tennessee") |
                                (population2019_df["state"] == "texas")]

# capitalize state names
population2019_df["state"] = population2019_df["state"].str.title()

population2019_df

         state  population_2019
4   California         39512223
9      Florida         21477737
32    New York         19453561
42   Tennessee          6829174
43       Texas         28995881

#### 2020 Population Data

In [12]:
# rename state abbreviation column to match other datasets
population2020_df = population2020_df.rename(columns={
                                        '2020_census': 'population_2020'})

In [13]:
# drop excess columns
population2020_df = population2020_df.drop(population2020_df.columns[[0,2,4]], axis=1)

In [14]:
# keep only states: ca, fl, ny, tx, tn
population2020_df = population2020_df.loc[
                                (population2020_df["state"] == "California") |
                                (population2020_df["state"] == "Florida") |
                                (population2020_df["state"] == "New York") |
                                (population2020_df["state"] == "Tennessee") |
                                (population2020_df["state"] == "Texas")]

population2020_df

         state  population_2020
0   California         39538223
1        Texas         29145505
2      Florida         21538187
3     New York         20201249
15   Tennessee          6910840

#### 2021 Population Data

In [15]:
# rename state column to match other datasets
population2021_df = population2021_df.rename(columns={
                                        'state_name': 'state',
                                        'pop_2021': 'population_2021'})

In [16]:
# drop excess columns
population2021_df = population2021_df.drop(population2021_df.columns[[1,2,3,4,6]], axis=1)

In [17]:
# keep only states: ca, fl, ny, tx, tn
population2021_df = population2021_df.loc[
                                (population2021_df["state"] == "california") |
                                (population2021_df["state"] == "florida") |
                                (population2021_df["state"] == "new york") |
                                (population2021_df["state"] == "tennessee") |
                                (population2021_df["state"] == "texas")]

# capitalize state names
population2021_df["state"] = population2021_df["state"].str.title()

population2021_df

         state  population_2021
5   California       39237836.0
10     Florida       21781128.0
33    New York       19835913.0
43   Tennessee        6975218.0
44       Texas       29527941.0

#### Zillow Data

In [18]:
# date format: yyyy-mm-dd to yyyy-mm
zillow_df['date'] = pd.to_datetime(zillow_df['Unnamed: 0'])
zillow_df['date'] = zillow_df['date'].dt.strftime('%Y-%m')

zillow_df.head()

,Unnamed: 0,Virginia,California,Florida,Texas,New York,Arizona,New Jersey,West Virginia,Nevada,...,New Hampshire,Alaska,Oklahoma,Arkansas,Alabama,Louisiana,South Dakota,Wyoming,Mississippi,date
0,2000-01-01,137233.0,199238.0,115665.0,114445.0,150761.0,135257.0,185076.0,71413.0,162642.0,...,139728.0,132292.0,80820.0,81668.0,103937.0,106413.0,119069.0,NaN,85835.0,2000-01
1,2000-02-01,137726.0,200084.0,116007.0,114569.0,151532.0,135585.0,185840.0,71473.0,162689.0,...,140419.0,132480.0,80886.0,81842.0,104218.0,106762.0,118802.0,NaN,85847.0,2000-02
2,2000-03-01,138185.0,201150.0,116368.0,114609.0,152176.0,135970.0,186480.0,71547.0,163004.0,...,141141.0,132632.0,81104.0,81995.0,104372.0,106969.0,118429.0,NaN,85893.0,2000-03
3,2000-04-01,139012.0,203391.0,117069.0,114816.0,153537.0,136721.0,187858.0,71680.0,163673.0,...,142118.0,132759.0,81443.0,82306.0,104722.0,107434.0,118016.0,NaN,86054.0,2000-04
4,2000-05-01,139735.0,205795.0,117736.0,114866.0,154766.0,137503.0,189055.0,71811.0,164384.0,...,143135.0,133007.0,81847.0,82533.0,105052.0,107821.0,117942.0,NaN,86481.0,2000-05

In [19]:
# keep only states: ca, fl, ny, tx, tn
zillow_df = zillow_df.drop(zillow_df.columns[[0,1,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51]], axis=1)
zillow_df

     California   Florida     Texas  New York  Tennessee     date
0      199238.0  115665.0  114445.0  150761.0   114902.0  2000-01
1      200084.0  116007.0  114569.0  151532.0   115091.0  2000-02
2      201150.0  116368.0  114609.0  152176.0   115238.0  2000-03
3      203391.0  117069.0  114816.0  153537.0   115569.0  2000-04
4      205795.0  117736.0  114866.0  154766.0   115862.0  2000-05
..          ...       ...       ...       ...        ...      ...
268    786581.0  386659.0  307725.0  401823.0   295963.0  2022-05
269    788876.0  395702.0  312431.0  405965.0   301394.0  2022-06
270    785718.0  401918.0  314903.0  409031.0   305262.0  2022-07
271    776658.0  405473.0  315801.0  410871.0   308001.0  2022-08
272    769405.0  406988.0  315815.0  411861.0   309460.0  2022-09

[273 rows x 6 columns]

In [20]:
# keep only dates jan 2019 - dec 2021
zillow19to21_df = zillow_df[
                        (zillow_df["date"] >= "2019-01") & 
                        (zillow_df["date"] <= "2021-12")]
zillow19to21_df

     California   Florida     Texas  New York  Tennessee     date
228    541734.0  242864.0  209975.0  306208.0   189360.0  2019-01
229    540860.0  243677.0  211058.0  307296.0   190324.0  2019-02
230    540689.0  244238.0  211792.0  308527.0   191297.0  2019-03
231    541412.0  244732.0  212233.0  309502.0   192141.0  2019-04
232    542452.0  245156.0  212653.0  310347.0   193000.0  2019-05
233    543337.0  245650.0  213134.0  310838.0   193727.0  2019-06
234    543299.0  246186.0  213643.0  311151.0   194317.0  2019-07
235    543715.0  246563.0  214279.0  311327.0   194953.0  2019-08
236    544780.0  246866.0  215056.0  311418.0   195709.0  2019-09
237    546713.0  247309.0  215506.0  311573.0   196594.0  2019-10
238    548143.0  248020.0  215893.0  311984.0   197594.0  2019-11
239    550160.0  248737.0  216103.0  312692.0   198596.0  2019-12
240    552721.0  249774.0  216706.0  313646.0   199645.0  2020-01
241    556649.0  251083.0  217248.0  314735.0   200955.0  2020-02
242    561177.0  252642.0  218029.0  315723.0   202448.0  2020-03
243    564566.0  254087.0  218709.0  316656.0   203957.0  2020-04
244    564465.0  255273.0  219287.0  317118.0   205260.0  2020-05
245    563398.0  256174.0  219855.0  317655.0   206521.0  2020-06
246    565639.0  256958.0  220665.0  318763.0   207741.0  2020-07
247    572290.0  258505.0  222061.0  320614.0   209033.0  2020-08
248    580794.0  260607.0  223988.0  323306.0   210492.0  2020-09
249    589012.0  263139.0  226248.0  326694.0   212259.0  2020-10
250    596581.0  265736.0  228520.0  330422.0   214563.0  2020-11
251    603433.0  268438.0  230701.0  334088.0   217073.0  2020-12
252    609605.0  271587.0  232976.0  337421.0   220288.0  2021-01
253    616633.0  274719.0  235763.0  340754.0   223268.0  2021-02
254    624408.0  278423.0  238725.0  344016.0   226343.0  2021-03
255    634596.0  282426.0  242387.0  347252.0   229261.0  2021-04
256    648775.0  287854.0  246734.0  351362.0   232829.0  2021-05
257    665848.0  294699.0  252187.0  356336.0   237147.0  2021-06
258    684277.0  302639.0  257859.0  362009.0   242076.0  2021-07
259    697852.0  310684.0  263547.0  366878.0   247159.0  2021-08
260    707582.0  318579.0  268414.0  370943.0   252136.0  2021-09
261    712526.0  325959.0  272700.0  374021.0   256980.0  2021-10
262    717943.0  333269.0  276346.0  376925.0   261933.0  2021-11
263    724656.0  340075.0  280622.0  379798.0   267856.0  2021-12

In [21]:
# format zillow df
zillow19to21_df = zillow19to21_df.copy()

# remove decimals from appropriate columns
zillow19to21_df["California"] = zillow19to21_df["California"].map("{:.0f}".format)
zillow19to21_df["Florida"] = zillow19to21_df["Florida"].map("{:.0f}".format)
zillow19to21_df["New York"] = zillow19to21_df["New York"].map("{:.0f}".format)
zillow19to21_df["Tennessee"] = zillow19to21_df["Tennessee"].map("{:.0f}".format)
zillow19to21_df["Texas"] = zillow19to21_df["Texas"].map("{:.0f}".format)

# reorder columns
zillow19to21_df = zillow19to21_df[[
    "date",
    "California",
    "Florida",
    "New York",
    "Tennessee",
    "Texas"]]

zillow19to21_df.head()

        date California Florida New York Tennessee   Texas
228  2019-01     541734  242864   306208    189360  209975
229  2019-02     540860  243677   307296    190324  211058
230  2019-03     540689  244238   308527    191297  211792
231  2019-04     541412  244732   309502    192141  212233
232  2019-05     542452  245156   310347    193000  212653

In [22]:
# swap rows and columns
zillow19to21_transposed = zillow19to21_df.transpose()
zillow19to21_transposed

,228,229,230,231,232,233,234,235,236,237,...,254,255,256,257,258,259,260,261,262,263
date,2019-01,2019-02,2019-03,2019-04,2019-05,2019-06,2019-07,2019-08,2019-09,2019-10,...,2021-03,2021-04,2021-05,2021-06,2021-07,2021-08,2021-09,2021-10,2021-11,2021-12
California,541734,540860,540689,541412,542452,543337,543299,543715,544780,546713,...,624408,634596,648775,665848,684277,697852,707582,712526,717943,724656
Florida,242864,243677,244238,244732,245156,245650,246186,246563,246866,247309,...,278423,282426,287854,294699,302639,310684,318579,325959,333269,340075
New York,306208,307296,308527,309502,310347,310838,311151,311327,311418,311573,...,344016,347252,351362,356336,362009,366878,370943,374021,376925,379798
Tennessee,189360,190324,191297,192141,193000,193727,194317,194953,195709,196594,...,226343,229261,232829,237147,242076,247159,252136,256980,261933,267856
Texas,209975,211058,211792,212233,212653,213134,213643,214279,215056,215506,...,238725,242387,246734,252187,257859,263547,268414,272700,276346,280622

In [23]:
# insert dates as column names
zillow19to21_transposed.columns = zillow19to21_transposed.iloc[0]
zillow19to21_transposed = zillow19to21_transposed.drop(labels=['date'])
zillow19to21_transposed.index.name = 'state'
zillow19to21_transposed

date,2019-01,2019-02,2019-03,2019-04,2019-05,2019-06,2019-07,2019-08,2019-09,2019-10,...,2021-03,2021-04,2021-05,2021-06,2021-07,2021-08,2021-09,2021-10,2021-11,2021-12
state,,,,,,,,,,,,,,,,,,,,,
California,541734,540860,540689,541412,542452,543337,543299,543715,544780,546713,...,624408,634596,648775,665848,684277,697852,707582,712526,717943,724656
Florida,242864,243677,244238,244732,245156,245650,246186,246563,246866,247309,...,278423,282426,287854,294699,302639,310684,318579,325959,333269,340075
New York,306208,307296,308527,309502,310347,310838,311151,311327,311418,311573,...,344016,347252,351362,356336,362009,366878,370943,374021,376925,379798
Tennessee,189360,190324,191297,192141,193000,193727,194317,194953,195709,196594,...,226343,229261,232829,237147,242076,247159,252136,256980,261933,267856
Texas,209975,211058,211792,212233,212653,213134,213643,214279,215056,215506,...,238725,242387,246734,252187,257859,263547,268414,272700,276346,280622

In [24]:
# rename columns for sql
zillow19to21_transposed["jan19"] = zillow19to21_transposed["2019-01"]
zillow19to21_transposed["feb19"] = zillow19to21_transposed["2019-02"]
zillow19to21_transposed["mar19"] = zillow19to21_transposed["2019-03"]
zillow19to21_transposed["apr19"] = zillow19to21_transposed["2019-04"]
zillow19to21_transposed["may19"] = zillow19to21_transposed["2019-05"]
zillow19to21_transposed["jun19"] = zillow19to21_transposed["2019-06"]
zillow19to21_transposed["jul19"] = zillow19to21_transposed["2019-07"]
zillow19to21_transposed["aug19"] = zillow19to21_transposed["2019-08"]
zillow19to21_transposed["sep19"] = zillow19to21_transposed["2019-09"]
zillow19to21_transposed["oct19"] = zillow19to21_transposed["2019-10"]
zillow19to21_transposed["nov19"] = zillow19to21_transposed["2019-11"]
zillow19to21_transposed["dec19"] = zillow19to21_transposed["2019-12"]

zillow19to21_transposed["jan20"] = zillow19to21_transposed["2020-01"]
zillow19to21_transposed["feb20"] = zillow19to21_transposed["2020-02"]
zillow19to21_transposed["mar20"] = zillow19to21_transposed["2020-03"]
zillow19to21_transposed["apr20"] = zillow19to21_transposed["2020-04"]
zillow19to21_transposed["may20"] = zillow19to21_transposed["2020-05"]
zillow19to21_transposed["jun20"] = zillow19to21_transposed["2020-06"]
zillow19to21_transposed["jul20"] = zillow19to21_transposed["2020-07"]
zillow19to21_transposed["aug20"] = zillow19to21_transposed["2020-08"]
zillow19to21_transposed["sep20"] = zillow19to21_transposed["2020-09"]
zillow19to21_transposed["oct20"] = zillow19to21_transposed["2020-10"]
zillow19to21_transposed["nov20"] = zillow19to21_transposed["2020-11"]
zillow19to21_transposed["dec20"] = zillow19to21_transposed["2020-12"]

zillow19to21_transposed["jan21"] = zillow19to21_transposed["2021-01"]
zillow19to21_transposed["feb21"] = zillow19to21_transposed["2021-02"]
zillow19to21_transposed["mar21"] = zillow19to21_transposed["2021-03"]
zillow19to21_transposed["apr21"] = zillow19to21_transposed["2021-04"]
zillow19to21_transposed["may21"] = zillow19to21_transposed["2021-05"]
zillow19to21_transposed["jun21"] = zillow19to21_transposed["2021-06"]
zillow19to21_transposed["jul21"] = zillow19to21_transposed["2021-07"]
zillow19to21_transposed["aug21"] = zillow19to21_transposed["2021-08"]
zillow19to21_transposed["sep21"] = zillow19to21_transposed["2021-09"]
zillow19to21_transposed["oct21"] = zillow19to21_transposed["2021-10"]
zillow19to21_transposed["nov21"] = zillow19to21_transposed["2021-11"]
zillow19to21_transposed["dec21"] = zillow19to21_transposed["2021-12"]

# drop old columns
zillow19to21_transposed = zillow19to21_transposed.drop(zillow19to21_transposed.columns[[0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31,32,33,34,35]], axis=1)
zillow19to21_transposed

date,jan19,feb19,mar19,apr19,may19,jun19,jul19,aug19,sep19,oct19,...,mar21,apr21,may21,jun21,jul21,aug21,sep21,oct21,nov21,dec21
state,,,,,,,,,,,,,,,,,,,,,
California,541734,540860,540689,541412,542452,543337,543299,543715,544780,546713,...,624408,634596,648775,665848,684277,697852,707582,712526,717943,724656
Florida,242864,243677,244238,244732,245156,245650,246186,246563,246866,247309,...,278423,282426,287854,294699,302639,310684,318579,325959,333269,340075
New York,306208,307296,308527,309502,310347,310838,311151,311327,311418,311573,...,344016,347252,351362,356336,362009,366878,370943,374021,376925,379798
Tennessee,189360,190324,191297,192141,193000,193727,194317,194953,195709,196594,...,226343,229261,232829,237147,242076,247159,252136,256980,261933,267856
Texas,209975,211058,211792,212233,212653,213134,213643,214279,215056,215506,...,238725,242387,246734,252187,257859,263547,268414,272700,276346,280622

In [25]:
zillow19to21_transposed.dtypes

date
jan19    object
feb19    object
mar19    object
apr19    object
may19    object
jun19    object
jul19    object
aug19    object
sep19    object
oct19    object
nov19    object
dec19    object
jan20    object
feb20    object
mar20    object
apr20    object
may20    object
jun20    object
jul20    object
aug20    object
sep20    object
oct20    object
nov20    object
dec20    object
jan21    object
feb21    object
mar21    object
apr21    object
may21    object
jun21    object
jul21    object
aug21    object
sep21    object
oct21    object
nov21    object
dec21    object
dtype: object

In [26]:
zillow19to21_transposed = zillow19to21_transposed.apply(pd.to_numeric)
zillow19to21_transposed.dtypes

date
jan19    int64
feb19    int64
mar19    int64
apr19    int64
may19    int64
jun19    int64
jul19    int64
aug19    int64
sep19    int64
oct19    int64
nov19    int64
dec19    int64
jan20    int64
feb20    int64
mar20    int64
apr20    int64
may20    int64
jun20    int64
jul20    int64
aug20    int64
sep20    int64
oct20    int64
nov20    int64
dec20    int64
jan21    int64
feb21    int64
mar21    int64
apr21    int64
may21    int64
jun21    int64
jul21    int64
aug21    int64
sep21    int64
oct21    int64
nov21    int64
dec21    int64
dtype: object

#### Housing Data

In [27]:
housing_df

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,for_sale,67000.0,2.0,1.0,0.15,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,for_sale,145000.0,4.0,2.0,0.10,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731.0,1800.0,NaN
4,for_sale,65000.0,6.0,2.0,0.05,"14 Navarro, Mayaguez, PR, 00680",14 Navarro,Mayaguez,Puerto Rico,680.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
923154,for_sale,445000.0,1.0,2.0,0.99,"1008 King St, Chappaqua, NY, 10514",1008 King St,Chappaqua,New York,10514.0,1052.0,2011-05-09
923155,for_sale,418000.0,4.0,2.0,0.40,"3 Elmwood Dr, Monroe, NY, 10950",3 Elmwood Dr,Monroe,New York,10950.0,1650.0,2015-07-21
923156,for_sale,469000.0,4.0,2.0,0.18,"13 N Conger Ave, Congers, NY, 10920",13 N Conger Ave,Congers,New York,10920.0,2123.0,NaN
923157,for_sale,825000.0,5.0,5.0,0.79,"7 Miller Rd, Valley Cottage, NY, 10989",7 Miller Rd,Valley Cottage,New York,10989.0,3775.0,2010-06-02
923158,for_sale,88000.0,NaN,NaN,35.00,"D18 Half Moon Bay Dr, Croton On Hudson, NY, 10520",D18 Half Moon Bay Dr,Croton On Hudson,New York,10520.0,780.0,NaN

In [28]:
# drop unnecessary columns
housing_df = housing_df.drop(housing_df.columns[[5,6,]], axis=1)

In [29]:
# keep only states: ny, tn
housing_df = housing_df.loc[
                        (housing_df["state"] == "New York") |
                        (housing_df["state"] == "Tennessee")]
housing_df

,status,price,bed,bath,acre_lot,city,state,zip_code,house_size,sold_date
30149,for_sale,175000.0,3.0,1.0,60.00,Berlin,New York,12022.0,1176.0,NaN
54248,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54258,for_sale,225000.0,4.0,2.0,0.24,Copake,New York,12521.0,1239.0,2018-02-01
54259,for_sale,419000.0,3.0,3.0,1.90,Copake,New York,12516.0,1800.0,NaN
54262,for_sale,365000.0,3.0,2.0,2.00,Copake,New York,12517.0,1482.0,NaN
...,...,...,...,...,...,...,...,...,...,...
923154,for_sale,445000.0,1.0,2.0,0.99,Chappaqua,New York,10514.0,1052.0,2011-05-09
923155,for_sale,418000.0,4.0,2.0,0.40,Monroe,New York,10950.0,1650.0,2015-07-21
923156,for_sale,469000.0,4.0,2.0,0.18,Congers,New York,10920.0,2123.0,NaN
923157,for_sale,825000.0,5.0,5.0,0.79,Valley Cottage,New York,10989.0,3775.0,2010-06-02
923158,for_sale,88000.0,NaN,NaN,35.00,Croton On Hudson,New York,10520.0,780.0,NaN

In [30]:
# keep only dates jan 2019 - dec 2021
housing_df = housing_df[
                    (housing_df["sold_date"] >= "2019-01-01") & 
                    (housing_df["sold_date"] <= "2021-12-31")]
housing_df

,status,price,bed,bath,acre_lot,city,state,zip_code,house_size,sold_date
54248,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54533,for_sale,435000.0,3.0,2.0,5.01,East Chatham,New York,12060.0,2504.0,2020-11-09
54551,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54952,for_sale,625000.0,NaN,NaN,19.70,Hillsdale,New York,12529.0,NaN,2021-01-20
55599,for_sale,625000.0,NaN,NaN,19.70,Hillsdale,New York,12529.0,NaN,2021-01-20
...,...,...,...,...,...,...,...,...,...,...
923109,for_sale,799000.0,5.0,4.0,2.32,Tomkins Cove,New York,10986.0,3280.0,2021-04-15
923110,for_sale,1200000.0,4.0,3.0,5.20,Stony Point,New York,10980.0,2800.0,2021-01-08
923142,for_sale,799000.0,5.0,3.0,0.11,West Harrison,New York,10604.0,2420.0,2019-08-12
923148,for_sale,519000.0,4.0,3.0,0.54,Cornwall,New York,12518.0,2612.0,2020-01-13
923149,for_sale,355000.0,3.0,3.0,0.16,New Windsor,New York,12553.0,1680.0,2019-06-28

In [31]:
# drop rows with null values
housing_df = housing_df.dropna()
housing_df

,status,price,bed,bath,acre_lot,city,state,zip_code,house_size,sold_date
54248,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
54533,for_sale,435000.0,3.0,2.0,5.01,East Chatham,New York,12060.0,2504.0,2020-11-09
54551,for_sale,425000.0,3.0,2.0,2.02,Claverack,New York,12521.0,1600.0,2021-11-24
56030,for_sale,339000.0,4.0,5.0,0.51,New Lebanon,New York,12125.0,3133.0,2019-09-11
56088,for_sale,625000.0,4.0,2.0,5.20,Copake Falls,New York,12517.0,2029.0,2019-10-23
...,...,...,...,...,...,...,...,...,...,...
923109,for_sale,799000.0,5.0,4.0,2.32,Tomkins Cove,New York,10986.0,3280.0,2021-04-15
923110,for_sale,1200000.0,4.0,3.0,5.20,Stony Point,New York,10980.0,2800.0,2021-01-08
923142,for_sale,799000.0,5.0,3.0,0.11,West Harrison,New York,10604.0,2420.0,2019-08-12
923148,for_sale,519000.0,4.0,3.0,0.54,Cornwall,New York,12518.0,2612.0,2020-01-13
923149,for_sale,355000.0,3.0,3.0,0.16,New Windsor,New York,12553.0,1680.0,2019-06-28

In [32]:
housing_df.dtypes

status         object
price         float64
bed           float64
bath          float64
acre_lot      float64
city           object
state          object
zip_code      float64
house_size    float64
sold_date      object
dtype: object

## Export Data to PostgreSQL Database

In [34]:
# export dataframes to perform sql join to add populations to zillow & housing dataframes
population2019_df.to_sql(name="population_2019", con=engine)
population2020_df.to_sql(name="population_2020", con=engine)
population2021_df.to_sql(name="population_2021", con=engine)
zillow19to21_transposed.to_sql(name="zillow", con=engine)
housing_df.to_sql(name="housing", con=engine)